In [1]:
import pandas as pd

data = pd.read_csv('train.csv')
data.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won?,avg_training_score,is_promoted
0,65438,Sales & Marketing,region_7,Master's & above,f,sourcing,1,35,5.0,8,0,49,0
1,65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,60,0
2,7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,50,0
3,2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,50,0
4,48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,73,0

In [2]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54808 entries, 0 to 54807
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           54808 non-null  int64
 1   department            54808 non-null  object
 2   region                54808 non-null  object
 3   education             52399 non-null  object
 4   gender                54808 non-null  object
 5   recruitment_channel   54808 non-null  object
 6   no_of_trainings       54808 non-null  int64
 7   age                   54808 non-null  int64
 8   previous_year_rating  50684 non-null  float64
 9   length_of_service     54808 non-null  int64
 10  awards_won?           54808 non-null  int64
 11  avg_training_score    54808 non-null  int64
 12  is_promoted           54808 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 5.4+ MB

In [3]:
data = data.dropna()

data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48660 entries, 0 to 54807
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           48660 non-null  int64
 1   department            48660 non-null  object
 2   region                48660 non-null  object
 3   education             48660 non-null  object
 4   gender                48660 non-null  object
 5   recruitment_channel   48660 non-null  object
 6   no_of_trainings       48660 non-null  int64
 7   age                   48660 non-null  int64
 8   previous_year_rating  48660 non-null  float64
 9   length_of_service     48660 non-null  int64
 10  awards_won?           48660 non-null  int64
 11  avg_training_score    48660 non-null  int64
 12  is_promoted           48660 non-null  int64
dtypes: float64(1), int64(7), object(5)
memory usage: 5.2+ MB

In [4]:
data = data.drop(columns=['employee_id'])
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48660 entries, 0 to 54807
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   department            48660 non-null  object
 1   region                48660 non-null  object
 2   education             48660 non-null  object
 3   gender                48660 non-null  object
 4   recruitment_channel   48660 non-null  object
 5   no_of_trainings       48660 non-null  int64
 6   age                   48660 non-null  int64
 7   previous_year_rating  48660 non-null  float64
 8   length_of_service     48660 non-null  int64
 9   awards_won?           48660 non-null  int64
 10  avg_training_score    48660 non-null  int64
 11  is_promoted           48660 non-null  int64
dtypes: float64(1), int64(6), object(5)
memory usage: 4.8+ MB

In [5]:
data.department.value_counts()

Sales & Marketing    14239
Operations           10547
Procurement           6641
Technology            6502
Analytics             4610
Finance               2219
HR                    2142
R&D                    893
Legal                  867
Name: department, dtype: int64

In [6]:
data.region.unique()

array(['region_7', 'region_22', 'region_19', 'region_23', 'region_26',
       'region_2', 'region_20', 'region_34', 'region_1', 'region_4',
       'region_29', 'region_31', 'region_15', 'region_14', 'region_11',
       'region_5', 'region_28', 'region_17', 'region_13', 'region_16',
       'region_25', 'region_10', 'region_27', 'region_30', 'region_12',
       'region_21', 'region_32', 'region_6', 'region_33', 'region_8',
       'region_24', 'region_3', 'region_9', 'region_18'], dtype=object)

In [7]:
data.education.value_counts()

Bachelor's          33404
Master's & above    14798
Below Secondary       458
Name: education, dtype: int64

In [8]:
data.gender.value_counts()

m    33852
f    14808
Name: gender, dtype: int64

In [9]:
data['gender'] = data['gender'].replace({'m': 'male', 'f': 'female'})
data['gender'].value_counts()

male      33852
female    14808
Name: gender, dtype: int64

In [10]:
data.recruitment_channel.value_counts()

other       27017
sourcing    20623
referred     1020
Name: recruitment_channel, dtype: int64

In [11]:
data['no_of_trainings'].value_counts()

1     39400
2      7107
3      1579
4       402
5       116
6        34
7        10
10        5
8         4
9         3
Name: no_of_trainings, dtype: int64

In [12]:
data['previous_year_rating'].value_counts()

3.0    17867
5.0    11362
4.0     9509
1.0     5887
2.0     4035
Name: previous_year_rating, dtype: int64

In [13]:
data['length_of_service'].unique()

array([ 8,  4,  7, 10,  2,  5,  6,  3, 16,  9, 26, 12, 11, 17, 14, 13, 19,
       15, 23, 20, 18, 22, 25, 28,  1, 24, 31, 21, 29, 30, 34, 27, 33, 32,
       37], dtype=int64)

In [14]:
data = data.rename(columns={'awards_won?': 'awards_won'})

In [15]:
data['awards_won'] = data['awards_won'].astype('str')

In [16]:
data['awards_won'] = data['awards_won'].replace({'0': 'No', '1': 'Yes'})

In [17]:
data['awards_won'].value_counts()

No     47534
Yes     1126
Name: awards_won, dtype: int64

In [18]:
data['awards_won'].unique()

array(['No', 'Yes'], dtype=object)

In [19]:
data['avg_training_score'].unique()

array([49, 60, 50, 73, 85, 59, 63, 83, 54, 80, 84, 77, 51, 46, 75, 68, 79,
       72, 61, 58, 87, 47, 57, 52, 88, 71, 48, 65, 62, 53, 78, 44, 91, 82,
       69, 74, 86, 90, 92, 67, 89, 56, 76, 81, 70, 45, 55, 39, 94, 93, 64,
       66, 95, 42, 96, 40, 99, 43, 97, 41, 98], dtype=int64)

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48660 entries, 0 to 54807
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   department            48660 non-null  object
 1   region                48660 non-null  object
 2   education             48660 non-null  object
 3   gender                48660 non-null  object
 4   recruitment_channel   48660 non-null  object
 5   no_of_trainings       48660 non-null  int64
 6   age                   48660 non-null  int64
 7   previous_year_rating  48660 non-null  float64
 8   length_of_service     48660 non-null  int64
 9   awards_won            48660 non-null  object
 10  avg_training_score    48660 non-null  int64
 11  is_promoted           48660 non-null  int64
dtypes: float64(1), int64(5), object(6)
memory usage: 4.8+ MB

In [21]:
data.head()

,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score,is_promoted
0,Sales & Marketing,region_7,Master's & above,female,sourcing,1,35,5.0,8,No,49,0
1,Operations,region_22,Bachelor's,male,other,1,30,5.0,4,No,60,0
2,Sales & Marketing,region_19,Bachelor's,male,sourcing,1,34,3.0,7,No,50,0
3,Sales & Marketing,region_23,Bachelor's,male,other,2,39,1.0,10,No,50,0
4,Technology,region_26,Bachelor's,male,other,1,45,3.0,2,No,73,0

In [22]:
data = data.to_excel('clean.xlsx', index=False)
print('Data berhasil disimpan')

Data berhasil disimpan